cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
#include <Wire.h>
#include <EEPROM.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include "BluetoothSerial.h" // Bluetooth seri haberleşme kütüphanesi
// Wi-Fi ve OTA etkinlik kontrol değişkenleri
#define WIFI_ENABLED  0  // 1: WiFi açık,  0: WiFi kapalı

#if WIFI_ENABLED
#include <WiFi.h>
#include <WebServer.h>
#include <ElegantOTA.h>

// Wi-Fi ayarları
const char* ssid = "wifi ag adı yazın"; // Wi-Fi ağ adı
const char* password = "wifi şifrenizi yazın"; // Wi-Fi şifresi
// Sabit IP ayarları
IPAddress local_IP(192, 168, 1, 12);  // Sabit IP adresi
IPAddress gateway(192, 168, 1, 1);    // Ağ geçidi (genellikle router IP'si)
IPAddress subnet(255, 255, 255, 0);   // Alt ağ maskesi


WebServer server(80); // Web sunucusu 80 numaralı portt


#endif // WIFI_ENABLED


// === OLED ===
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define OLED_SDA 4
#define OLED_SCL 5
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);

// === PINLER ===
#define ENCODER_PIN_A 32
#define ENCODER_PIN_B 33
#define ENCODER_BUTTON 25
#define BUZZER_PIN 26
#define charge_on_of 27
#define BATTERY_ADC_PIN 35
#define LOW_VOLTAGE_THRESHOLD 11.0 // Batarya tipinize göre güncelleyin
#define CHARGE_ADC_PIN 34
#define CHARGE_PRESENT_THRESHOLD 3.0 // Gerilim bölücüye göre ayarla (adaptörün voltajını böldükten sonra bu pindeki voltaj eşiği)

const uint8_t pwmPins[3][3] = {
  {16, 14, 13}, {19, 18, 17}, {23, 22, 21}
};
const uint8_t pwmChannels[3][3] = {
  {2, 1, 0}, {5, 4, 3}, {8, 7, 6}
};

// === EEPROM ===
#define EEPROM_SIZE 7
int hueAddr[3] = {0, 2, 4};
int brightnessAddr[3] = {1, 3, 5};
#define GROUP_ADDR 6

// === Kontrol Değişkenleri ===
int animationSpeed = 30; // Genel animasyon hızı
int hue[3] = {0, 0, 0};
float brightness[3] = {1.0, 1.0, 1.0};
int selectedGroup = -1; // -1: Tümü, 0-2: Grup 1-3, 3-7: Animasyonlar, 8: Bluetooth Renk Modu

volatile int encoderPos = 0;
int lastEncoderPos = 0;
int lastEncoded = 0;
unsigned long lastEncoderTime = 0;
unsigned long lastDisplayUpdate = 0;
unsigned long lastRainbowUpdate = 0;
unsigned long buttonPressTime = 0;
bool buttonPressed = false;
bool longPressHandled = false;
bool longPressCandidate = false;

bool chargingDisplayActive = false; // Batarya şarj ekranı aktif mi?
bool chargingDisplaySuppressed = false; // Batarya şarj ekranı kullanıcı tarafından gizlendi mi?

// Animasyonlar için durum değişkenleri
unsigned long lastAnimationTime = 0;
int currentGroup = 0;         // Kayar animasyonlarda hangi grubun sırası
int currentColorPhase = 0; // Kayar animasyonlarda 0: Kırmızı, 1: Mavi, 2: Yeşil
const int ON = 255;         // On/Off modu için tam parlaklık
const int OFF = 0;          // On/Off modu için kapalı
const int MAX_BRIGHTNESS_VAL = 255; // İz bırakan animasyon için tam parlaklık
const int MIN_BRIGHTNESS_VAL = 0;   // İz bırakan animasyon için kapalı
const int FADE_STEP = 10;         // İz bırakan animasyonda sönme adım miktarı
const unsigned long FADE_INTERVAL = 3; // İz bırakma sönme hızı (ms)

// Her grubun o anki renk değerlerini tutan değişkenler (fade için önemli)
int currentRGB[3][3] = {{0, 0, 0}, {0, 0, 0}, {0, 0, 0}}; // [grup][kanal]

// İz bırakan animasyon için değişkenler
unsigned long lastFadeTime[3] = {0, 0, 0}; // Her grubun son sönme zamanı
bool fading[3] = {false, false, false};   // Her grup sönüyor mu?

// === Bluetooth ===
BluetoothSerial SerialBT;
bool isBluetoothConnected = false; // Bluetooth bağlantı durumu
bool bluetoothColorMode = false;   // Bluetooth ile renk ayarı yapılıp yapılmadığını takip et

// === Fonksiyon Prototipleri ===
void updateDisplay();
void applyAllColors();
void allGroupsOff();
void startFadeOut(int group);
void handleFading();
void setGroupColor(int group, int r, int g, int b);
void drawBatteryMiniIcon(int x, int y, float voltage, bool charging);
void drawBatteryWithFillBars(float voltage, bool charging); // Eğer charge_anim.h kullanmıyorsanız bunu yorum satırı yapın
void bluetoothCallback(const uint8_t *buffer, size_t len); // Bluetooth callback prototipi
void rgbToHsv(int r, int g, int b, int &h, float &s, float &v); // Yeni fonksiyon prototipi

// Pil Yüzdesi için Fonksiyon (Eksik olduğu için ekledim)
int getFillBarsFromVoltage(float voltage) {
  // Bu fonksiyonu kendi batarya voltaj aralıklarınıza göre doldurmanız gerekmektedir.
  // Örnek olarak NiMH için bir skala sunulmuştur:
  if (voltage >= 18) digitalWrite(27, LOW);
  if (voltage >= 17.6) return 10; // Tam dolu (max 10 bar)
  else if (voltage >= 17.2) return 9; digitalWrite(27, HIGH);
  else if (voltage >= 17.0) return 8;
  else if (voltage >= 16.5) return 7;
  else if (voltage >= 15.0) return 6;
  else if (voltage >= 14.0) return 5;
  else if (voltage >= 13.0) return 4;
  else if (voltage >= 12.0) return 3;
  else if (voltage >= 11.0) return 2;
  else if (voltage >= 10.0) return 1; // Düşük pil
  else return 0; // Boş
}


void IRAM_ATTR readEncoder() {
  int MSB = digitalRead(ENCODER_PIN_A);
  int LSB = digitalRead(ENCODER_PIN_B);
  int encoded = (MSB << 1) | LSB;
  int transition = (lastEncoded << 2) | encoded;

  if (millis() - lastEncoderTime > 2) {
    if (transition == 0b0001 || transition == 0b0111 || transition == 0b1110 || transition == 0b1000)
      encoderPos++;
    else if (transition == 0b0010 || transition == 0b0100 || transition == 0b1101 || transition == 0b1011)
      encoderPos--;

    lastEncoded = encoded;
    lastEncoderTime = millis();
  }
}

int getNiMHBatteryPercentage(float voltage) {
  // Bu değerleri kendi batarya tipinize göre güncelleyin!
  // Örneğin, 4S NiMH için 4.8V nominal, 5.8V tam dolu
  // Bu aralıklar çok yüksek görünüyor, muhtemelen 12V kurşun asit veya çok hücreli NiMH.
  if (voltage >= 17.0) return 100;
  else if (voltage >= 16.5) return 90;
  else if (voltage >= 16.0) return 80;
  else if (voltage >= 15.5) return 70;
  else if (voltage >= 15.0) return 60;
  else if (voltage >= 14.5) return 50;
  else if (voltage >= 14.0) return 40;
  else if (voltage >= 13.5) return 30;
  else if (voltage >= 13.0) return 20;
  else return 10;
}

float readChargeVoltage() {
  int raw = analogRead(CHARGE_ADC_PIN);
  float voltage = raw / 4095.0 * 3.3;
  return voltage * (22.0 + 4.7) / 4.7; // Oran senin R1/R2 değerlerine göre (voltaj bölücü)
}

bool isChargingPluggedIn() {
  float v = readChargeVoltage();
  return v > CHARGE_PRESENT_THRESHOLD; // Bu eşiği adaptörünüze göre ayarlayın
}

float readBatteryVoltage() {
  int raw = analogRead(BATTERY_ADC_PIN);
  float voltage = raw / 4095.0 * 3.3;
  return voltage * (22.0 + 4.7) / 4.7; // Gerilim bölücü R1=22k, R2=4.7k için
}

