cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
void setupPWM(uint8_t pin, uint8_t channel) {
  ledcSetup(channel, 5000, 8); // 5 kHz frekans, 8 bit çözünürlük
  ledcAttachPin(pin, channel);
}



void hsvToRgb(int h, float v, int &r, int &g, int &b) {
  float s = 1.0; // Saturasyon genellikle tam dolu (1.0) tutulur
  float C = s * v;
  float X = C * (1 - abs(fmod(h / 60.0, 2) - 1));
  float m = v - C;
  float r1, g1, b1;
  if (h < 60)         { r1 = C; g1 = X; b1 = 0; }
  else if (h < 120){ r1 = X; g1 = C; b1 = 0; }
  else if (h < 180){ r1 = 0; g1 = C; b1 = X; }
  else if (h < 240){ r1 = 0; g1 = X; b1 = C; }
  else if (h < 300){ r1 = X; g1 = 0; b1 = C; }
  else           { r1 = C; g1 = 0; b1 = X; }
  r = (r1 + m) * 255;
  g = (g1 + m) * 255;
  b = (b1 + m) * 255;
}

// Yeni RGB'den HSV'ye dönüşüm fonksiyonu
void rgbToHsv(int r, int g, int b, int &h, float &s, float &v) {
  float fr = r / 255.0; // 0-1 aralığına normalize et
  float fg = g / 255.0;
  float fb = b / 255.0;

  float cmax = max(max(fr, fg), fb);
  float cmin = min(min(fr, fg), fb);
  float delta = cmax - cmin;

  if (delta == 0) {
    h = 0; // Renk yok, gri ton
  } else if (cmax == fr) {
    h = (int)(60 * fmod(((fg - fb) / delta), 6));
  } else if (cmax == fg) {
    h = (int)(60 * (((fb - fr) / delta) + 2));
  } else {
    h = (int)(60 * (((fr - fg) / delta) + 4));
  }
  if (h < 0) h += 360; // Negatif hue değerlerini düzelt

  s = (cmax == 0) ? 0 : delta / cmax; // Saturasyon
  v = cmax; // Value/Brightness (parlaklık)
}


void setGroupColor(int group, int r, int g, int b) {
  ledcWrite(pwmChannels[group][0], r); // Kırmızı
  ledcWrite(pwmChannels[group][1], g); // Yeşil
  ledcWrite(pwmChannels[group][2], b); // Mavi
  currentRGB[group][0] = r; // Mevcut durumu kaydet
  currentRGB[group][1] = g;
  currentRGB[group][2] = b;
}

// Tüm grupları kapatır
void allGroupsOff() {
  for (int g = 0; g < 3; g++) {
    setGroupColor(g, OFF, OFF, OFF);
  }
}

// Bir grubu sönmeye başlatır (bloklamaz)
void startFadeOut(int group) {
  fading[group] = true;
  lastFadeTime[group] = millis(); // Sönmenin başladığı zamanı kaydet
}

// Tüm sönme işlemlerini yöneten, loop içinde çağrılması gereken fonksiyon
void handleFading() {
  unsigned long currentTime = millis();
  for (int group = 0; group < 3; group++) {
    if (fading[group] && currentTime - lastFadeTime[group] >= FADE_INTERVAL) {
      lastFadeTime[group] = currentTime; // Bir sonraki sönme adımının zamanını güncelle

      int r = currentRGB[group][0];
      int g = currentRGB[group][1];
      int b = currentRGB[group][2];

      if (r > MIN_BRIGHTNESS_VAL || g > MIN_BRIGHTNESS_VAL || b > MIN_BRIGHTNESS_VAL) {
        if (r > MIN_BRIGHTNESS_VAL) r = max(r - FADE_STEP, MIN_BRIGHTNESS_VAL);
        if (g > MIN_BRIGHTNESS_VAL) g = max(g - FADE_STEP, MIN_BRIGHTNESS_VAL);
        if (b > MIN_BRIGHTNESS_VAL) b = max(b - FADE_STEP, MIN_BRIGHTNESS_VAL);
        setGroupColor(group, r, g, b); // Yeni, azaltılmış renk değerini uygula
      } else {
        fading[group] = false; // Tamamen söndü, sönmeyi durdur
        setGroupColor(group, MIN_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL); // Tamamen kapalı olduğundan emin ol
      }
    }
  }
}

void applyGroupColor(int i) {
  int r, g, b;
  hsvToRgb(hue[i], brightness[i], r, g, b);
  setGroupColor(i, r, g, b); // Artık setGroupColor fonksiyonu currentRGB'yi güncelliyor
}

void applyAllColors() {
  for (int i = 0; i < 3; i++) applyGroupColor(i);
}

void beepGroup(int count) {
  for (int i = 0; i < count; i++) {
    tone(BUZZER_PIN, 2000, 100);
    delay(200);
  }
}

void updateDisplay() {
  display.clearDisplay();

  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  // Mod başlığı (Tümü, Grup 1, Grup 2, Grup 3) her zaman üst satırda
  display.setCursor(0, 0);
  display.print("Mod:");
  display.setCursor(30, 0); // Mod adını Mod: yazısının sağına alıyoruz
  if (selectedGroup == -1) display.println("Tumu");
  else if (selectedGroup == 0) display.println("Grup 1");
  else if (selectedGroup == 1) display.println("Grup 2");
  else if (selectedGroup == 2) display.println("Grup 3");
  // Animasyon modları için başlıkları bir alt satıra alıyoruz
  else if (selectedGroup == 3) display.println("Rainbow");
  else if (selectedGroup == 4) display.println("Rand. Rainbow");
  else if (selectedGroup == 5) display.println("Fade Loop");
  else if (selectedGroup == 6) display.println("ON/OFF Kayma");
  else if (selectedGroup == 7) display.println("Iz Birakan");
  else if (selectedGroup == 8) display.println("BT Renk"); // Yeni: Bluetooth renk modu
  else if (selectedGroup == -2) display.println("Kapali"); // Bluetooth ile kapatildi

  // Animasyon hızını göster (sadece animasyon modlarında ve alt satırda)
  if (selectedGroup >= 3 && selectedGroup <= 7) {
    display.setCursor(0, 16); // Mod başlığından 2 satır alta in (8+8)
    display.printf("Hiz: %d ms", animationSpeed);
  }

  // LED gruplarının renk ve parlaklık bilgisi (sadece normal modlarda ve BT Renk modunda)
  if (selectedGroup < 3 || selectedGroup == -1 || selectedGroup == 8) { // Normal hue/brightness modları veya BT Renk modu
    for (int i = 0; i < 3; i++) {
      display.setCursor(0, 16 + i * 16); // İlk gruptan itibaren 16 piksel boşluk
     display.printf("G%d H:%3d B:%3d%%", i + 1, hue[i], int(brightness[i] * 100));
    }
  }

  // Şarj durumu varsa sağ üst köşeye ikonu çiz
  if (isChargingPluggedIn()) {
    float batVoltage = readBatteryVoltage();
    drawBatteryMiniIcon(SCREEN_WIDTH - 14, 0, batVoltage, true);
  }else  if (!isChargingPluggedIn()) {
    float batVoltage = readBatteryVoltage();
    drawBatteryMiniIcon(SCREEN_WIDTH - 14, 0, batVoltage, false);
  }

  // Bluetooth bağlantı durumu
  if (isBluetoothConnected) {
    display.setCursor(0, SCREEN_HEIGHT - 8); // En alt satırda
    display.print("BT Bagli");
  }

  display.display();
}

void sarz_oluyor() {
  bool ledlerKapandi = false;
  chargingDisplayActive = true;     // Şarj ekranı aktif hale geldi
  chargingDisplaySuppressed = false; // Önceki bastırma durumunu sıfırla

  while (isChargingPluggedIn()) {
    if (!ledlerKapandi) {
      for (int g = 0; g < 3; g++)
        for (int c = 0; c < 3; c++)
          ledcWrite(pwmChannels[g][c], 0);
      ledlerKapandi = true;
    }

    float voltage = readBatteryVoltage();
    // chargingDisplaySuppressed true ise büyük şarj ikonunu gösterme
    if (!chargingDisplaySuppressed) {
        drawBatteryWithFillBars(voltage, true);
    } else {
        display.clearDisplay();
        updateDisplay(); // Normal arayüze dön ama küçük ikonu göster.
    }

    if (voltage >= 16.4) { // Batarya doluluk eşiği
      digitalWrite(27, LOW);     // Şarjı kes
    } else {
      digitalWrite(27, HIGH); // Şarj devam
    }

    // 🔁 BUTONA BASILIRSA: ŞARJ EKRANINDAN ÇIK (Veya gizle)
    if (digitalRead(ENCODER_BUTTON) == LOW) {
      delay(50); // Buton debounce
      if (digitalRead(ENCODER_BUTTON) == LOW) {
        chargingDisplaySuppressed = true; // 🔥 Şarj ekranını gizle
        break; // sarz_oluyor döngüsünden çık
      }
    }
    delay(200);
  }

  // Şarj soketi çekildiğinde veya kullanıcı iptal ettiğinde
  digitalWrite(27, HIGH); // Şarjı kes (varsayılan olarak off)
  chargingDisplayActive = false; // Şarj ekranı artık aktif değil

