cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
  // Normal ekrana geri dön ve renkleri uygula
  display.clearDisplay();
  updateDisplay();
  applyAllColors();
  saveSettingsToEEPROM();
}

void saveSettingsToEEPROM() {
  for (int i = 0; i < 3; i++) {
    EEPROM.write(hueAddr[i], map(hue[i], 0, 360, 0, 255));
    EEPROM.write(brightnessAddr[i], brightness[i] * 255);
  }
  EEPROM.write(GROUP_ADDR, selectedGroup);
  EEPROM.commit();
}

void loadSettingsFromEEPROM() {
  for (int i = 0; i < 3; i++) {
    hue[i] = map(EEPROM.read(hueAddr[i]), 0, 255, 0, 360);
    brightness[i] = EEPROM.read(brightnessAddr[i]) / 255.0;
  }
  selectedGroup = EEPROM.read(GROUP_ADDR);
  if (selectedGroup > 8) selectedGroup = -1; // Geçersiz grup değeri kontrolü (yeni modlar 6, 7 ve 8)
}
int b;
void setup() {
  Serial.begin(115200);
// Wi-Fi ayarları
#if WIFI_ENABLED
  WiFi.config(local_IP, gateway, subnet);
  WiFi.begin(ssid, password);
  
  // Bağlantı kontrolü
  while (WiFi.status() != WL_CONNECTED) {
     b++;
    delay(1000);
    Serial.println("WiFi'ye bağlanılıyor...");
    if(b>3) break;
  }
  
  Serial.println("WiFi'ye bağlanıldı!");
  Serial.print("IP Adresi: ");
  Serial.println(WiFi.localIP());
  
  // Web sunucusu başlatma
ElegantOTA.begin(&server);
ElegantOTA.onProgress([](size_t current, size_t final) {
  if (current == final) tone(BUZZER_PIN, 2000, 300); // Güncelleme bittiğinde bip sesi
});
ElegantOTA.setAuth("cemyasam", "475234Cem"); // güvenlik şifresi
  server.begin();
  Serial.println("HTTP sunucu başlatıldı");
display.clearDisplay();
display.setTextSize(1);
display.setCursor(0, 0);
display.println("WiFi baglandi!");
display.println(WiFi.localIP());
display.println("OTA aktif...");
display.display();
 #endif


  pinMode(ENCODER_PIN_A, INPUT_PULLUP);
  pinMode(ENCODER_PIN_B, INPUT_PULLUP);
  pinMode(ENCODER_BUTTON, INPUT_PULLUP);
  pinMode(charge_on_of, OUTPUT); // Şarj kontrol pini
  digitalWrite(27, HIGH); // Başlangıçta şarjı kapalı tut (veya devrenize göre ayarla)
  pinMode(BUZZER_PIN, OUTPUT);

  // Bluetooth başlatma
  SerialBT.begin("ESP32_RGB_Kontrol"); // Bluetooth cihazınızın adı
  Serial.println("Bluetooth Aktif. Cihaz adi: ESP32_RGB_Kontrol");
  SerialBT.onData(bluetoothCallback); // Gelen veri için callback fonksiyonu

  attachInterrupt(digitalPinToInterrupt(ENCODER_PIN_A), readEncoder, CHANGE);
  attachInterrupt(digitalPinToInterrupt(ENCODER_PIN_B), readEncoder, CHANGE);

  for (int g = 0; g < 3; g++)
    for (int c = 0; c < 3; c++)
      setupPWM(pwmPins[g][c], pwmChannels[g][c]);

  EEPROM.begin(EEPROM_SIZE);
  loadSettingsFromEEPROM();
  applyAllColors();

  Wire.begin(OLED_SDA, OLED_SCL);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.clearDisplay();
  updateDisplay();
}

// Bluetooth'tan veri geldiğinde çağrılacak fonksiyon
void bluetoothCallback(const uint8_t *buffer, size_t len) {
  if (len > 0) {
    String commandStr = "";
    for (int i = 0; i < len; i++) {
      commandStr += (char)buffer[i];
    }
    commandStr.trim(); // Boşlukları temizle
    Serial.printf("Bluetooth Komut: '%s' (Uzunluk: %d)\n", commandStr.c_str(), len);

    // Animasyon komutları (tek karakter)
    if (commandStr.length() == 1) {
      char command = commandStr.charAt(0);
      bluetoothColorMode = false; // Animasyon komutu geldiğinde renk modu değiliz
      allGroupsOff(); // Animasyona geçerken LED'leri kapat

      if (command == 'A') {
        selectedGroup = 3; // Rainbow
      } else if (command == 'B') {
        selectedGroup = 4; // Offset Rainbow
      } else if (command == 'C') {
        selectedGroup = 5; // Fade Loop
      } else if (command == 'D') {
        selectedGroup = 6; // ON/OFF Kayma
      } else if (command == 'E') {
        selectedGroup = 7; // İz Bırakan Kayma
      } else if (command == 'O') { // Tüm LED'leri kapat
        allGroupsOff();
        selectedGroup = -2; // Bluetooth ile kapatıldığını belirtmek için özel mod
      } else if (command == 'N') { // Normal "Tümü" moduna dön
        selectedGroup = -1;
        applyAllColors(); // Renkleri geri uygula
      }
      // Daha fazla animasyon veya özel komut ekleyebilirsiniz
    }
    // RGB renk komutu (örneğin: "255,0,0" veya "0,255,0,1" veya "100,50,200,75" (R,G,B,Parlaklık))
    else if (commandStr.indexOf(',') != -1) {
      selectedGroup = 8; // Bluetooth renk modu
      bluetoothColorMode = true; // Renk ayarı yapıldığını işaretle

      int r_val, g_val, b_val;
      float bt_brightness = 1.0; // Varsayılan parlaklık (eğer komutta verilmezse)
      // Eğer şarj ekranı aktifse, otomatik olarak gizle
      if (isChargingPluggedIn()) { // Sadece şarjdayken bu önemli
          chargingDisplaySuppressed = true;
          Serial.println("BT renk komutu ile şarj ekranı gizlendi.");
      }
      // Virgüle göre ayır
      int firstComma = commandStr.indexOf(',');
      int secondComma = commandStr.indexOf(',', firstComma + 1);
      int thirdComma = commandStr.indexOf(',', secondComma + 1); // Parlaklık için dördüncü değer

      // R,G,B değerlerini ayrıştır
      r_val = commandStr.substring(0, firstComma).toInt();
      g_val = commandStr.substring(firstComma + 1, secondComma).toInt();
      if (thirdComma == -1) { // Eğer dördüncü değer yoksa (yani sadece R,G,B)
        b_val = commandStr.substring(secondComma + 1).toInt();
      } else { // Eğer dördüncü değer varsa (R,G,B,Parlaklık)
        b_val = commandStr.substring(secondComma + 1, thirdComma).toInt();
        // Parlaklık değeri 0-100 arasında gelebilir, 0.0-1.0 aralığına normalize et
        bt_brightness = commandStr.substring(thirdComma + 1).toFloat() / 100.0;
        bt_brightness = constrain(bt_brightness, 0.0, 1.0); // 0-1 aralığında tut
      }

      // Değerleri 0-255 aralığında sınırlayın
      r_val = constrain(r_val, 0, 255);
      g_val = constrain(g_val, 0, 255);
      b_val = constrain(b_val, 0, 255);

      // RGB'den HSV'ye dönüştür ve uygula
      int temp_h;
      float temp_s, temp_v;
      rgbToHsv(r_val, g_val, b_val, temp_h, temp_s, temp_v);

      // Tüm gruplara aynı hue ve Bluetooth'tan gelen parlaklığı uygula
      for (int i = 0; i < 3; i++) {
        hue[i] = temp_h;
        // Gelen RGB renginin kendi Value'su (temp_v) ile Bluetooth'tan gelen parlaklığı (bt_brightness) çarp
        brightness[i] = temp_v * bt_brightness; 
        brightness[i] = constrain(brightness[i], 0.0, 1.0); // 0-1 aralığında tut
      }
      applyAllColors(); // Yeni renkleri uygula
      Serial.printf("BT Renk Ayari: R:%d G:%d B:%d (Parlaklik: %.2f) -> H:%d B:%.2f\n", r_val, g_val, b_val, bt_brightness, hue[0], brightness[0]);
    } // 🔧 Bu parça, Bluetooth üzerinden gelen sadece parlaklık ve animasyon hızı komutlarını da işler hale getirildi.

