cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
// Mevcut kod içinde bluetoothCallback fonksiyonu altında bu kısmı BUL:
// 🔧 Bu parça, Bluetooth üzerinden gelen sadece parlaklık ve animasyon hızı komutlarını da işler hale getirildi.

// Mevcut kod içinde bluetoothCallback fonksiyonu altında bu kısmı BUL:
else if (commandStr.length() > 0) {
    // --- ANİMASYON HIZI KOMUTU ---
    char animLetter = commandStr.charAt(commandStr.length() - 1);
    if (animLetter >= 'A' && animLetter <= 'E') {
        String speedStr = commandStr.substring(0, commandStr.length() - 1);
        int speedVal = speedStr.toInt();

        if (speedVal >= 10 && speedVal <= 1000) {
            animationSpeed = speedVal;
            Serial.printf("✅ Animasyon Hizi Ayarlandi: %dms (Mod: %c)\n", animationSpeed, animLetter);

            // En son seçilen animasyon harfiyle eşleşen moda geç
            switch (animLetter) {
              case 'A': selectedGroup = 3; break;
              case 'B': selectedGroup = 4; break;
              case 'C': selectedGroup = 5; break;
              case 'D': selectedGroup = 6; break;
              case 'E': selectedGroup = 7; break;
            }

            // 🔥 Animasyonu tetikleyecek değişkenleri sıfırla
            currentGroup = 0;
            currentColorPhase = 0;
            lastAnimationTime = millis();
            allGroupsOff();
            for (int i = 0; i < 3; i++) {
              fading[i] = false;
              lastFadeTime[i] = 0;
            }

            updateDisplay();
            saveSettingsToEEPROM();
            return; // Diğer işlemleri atla
        } else {
            Serial.printf("⚠️ Gecersiz animasyon hizi: %d\n", speedVal);
            return;
        }
    }

    // --- PARLAKLIK KOMUTU (tek sayı, 0-255 arası) ---
    int numericValue = commandStr.toInt();
    if (numericValue >= 0 && numericValue <= 255) {
        float newBrightness = numericValue / 255.0;
        newBrightness = constrain(newBrightness, 0.0, 1.0);

        selectedGroup = 8;
        bluetoothColorMode = true;

        for (int i = 0; i < 3; i++) {
            int h, r = currentRGB[i][0], g = currentRGB[i][1], b = currentRGB[i][2];
            float s, v;
            rgbToHsv(r, g, b, h, s, v);
            hue[i] = h;
            brightness[i] = newBrightness;
        }

        applyAllColors();
        Serial.printf("✅ BT Parlaklik Ayari: %.2f\n", newBrightness);
        updateDisplay();
        saveSettingsToEEPROM();
        return;
    }
}



    // Ortak animasyon modlarına geçiş sonrası işlemler
    if (selectedGroup >= 3 && selectedGroup <= 7) { // Animasyon modları
      currentGroup = 0;
      currentColorPhase = 0;
      lastAnimationTime = millis(); // Animasyonu hemen başlat
      allGroupsOff(); // Önceki durumdan kalma yanık LED olmasın

      // İz bırakan animasyon için sönme durumlarını sıfırla
      for(int i = 0; i < 3; i++) {
          fading[i] = false;
          lastFadeTime[i] = 0;
      }
    } else if (selectedGroup != -2 && !bluetoothColorMode && (commandStr.length() == 1 && (commandStr.charAt(0) == 'A' || commandStr.charAt(0) == 'B' || commandStr.charAt(0) == 'C' || commandStr.charAt(0) == 'D' || commandStr.charAt(0) == 'E' || commandStr.charAt(0) == 'N'))) {
        // Animasyon seçimi veya "Normal" moda geçiş durumunda renkleri uygulamaya devam et
        // Ancak 'O' (Kapalı) komutu gelmediyse
        applyAllColors();
    } else if (bluetoothColorMode) { // Eğer Bluetooth renk modundaysak, renkleri uygula
      applyAllColors();
    }
    updateDisplay(); // Ekranı güncelle
    saveSettingsToEEPROM(); // Ayarları kaydet
  }
}

unsigned long lastButtonCheck = 0;
unsigned long lastOledUpdateGlobal = 0; // Global OLED güncelleme zamanlayıcısı

void loop() {
  unsigned long currentTime = millis(); // Loop'un başında zamanı bir kez al

  // Bluetooth bağlantı durumunu kontrol et
  static bool prevBluetoothConnected = false;
  // BluetoothSerial kütüphanesinin farklı versiyonları için uyumluluk kontrolü
  #if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 4 // ESP-IDF 4.x ve üzeri
    isBluetoothConnected = SerialBT.hasClient();
  #else // Daha eski ESP-IDF versiyonları veya Arduino ESP32 core'u
    isBluetoothConnected = SerialBT.connected();
  #endif


  if (isBluetoothConnected != prevBluetoothConnected) {
    updateDisplay(); // Bağlantı durumu değişince ekranı güncelle
    prevBluetoothConnected = isBluetoothConnected;
    if (isBluetoothConnected) {
      Serial.println("Bluetooth baglandi!");
    } else {
      Serial.println("Bluetooth baglantisi kesildi.");
    }
  }


  bool charging = isChargingPluggedIn();

  // Şarj takıldıysa VE daha önce kullanıcı tarafından gizlenmediyse şarj ekranını göster
  if (charging && !chargingDisplaySuppressed) {
    sarz_oluyor();
    return; // sarz_oluyor fonksiyonu bloke edici olduğu için burada return yapıyoruz
  }

  // Eğer artık şarjda değilse (kablo çekildiyse), gizleme bayrağını sıfırla
  if (!charging && chargingDisplaySuppressed) {
    chargingDisplaySuppressed = false; // Şarj kablosu çekildi, ekran gizleme sıfırlandı
    Serial.println("Şarj kablosu çekildi, ekran gizleme sıfırlandı.");
  }

  static bool btnPrevState = HIGH;
  bool btnState = digitalRead(ENCODER_BUTTON);

  // Rotary Encoder Okuma ve Ayar (Bluetooth ile kontrol edildiğinde devre dışı kalabilir veya öncelik verilebilir)
  // Şimdilik, Bluetooth bağlı olsa bile encoder çalışmaya devam edecek.
  if (encoderPos != lastEncoderPos) {
    int diff = encoderPos - lastEncoderPos;
    lastEncoderPos = encoderPos;

    if (digitalRead(ENCODER_BUTTON) == LOW) { // Buton basılıyken genel parlaklık ayarı
      if (selectedGroup == -1 || selectedGroup > 2 || selectedGroup == 8) { // BT renk modu için de geçerli
        float newLevel = constrain(brightness[0] + diff * 0.02, 0.0, 1.0);
        for (int i = 0; i < 3; i++) brightness[i] = newLevel;
      } else {
        brightness[selectedGroup] = constrain(brightness[selectedGroup] + diff * 0.02, 0.0, 1.0);
      }
    } else { // Buton basılı değilse:
      if (selectedGroup >= 3 && selectedGroup <= 7) { // Animasyon modları (3, 4, 5, 6, 7) için hız ayarı
        animationSpeed = constrain(animationSpeed - diff * 2, 10, 500); // 10ms-500ms arası
        Serial.printf("Animasyon Hizi: %dms\n", animationSpeed);
      } else { // Diğer modlarda renk ayarı (-1, 0, 1, 2, 8)
        if (selectedGroup == -1 || selectedGroup == 8) { // "Tümü" veya "BT Renk" modu için hue ayarı
          for (int i = 0; i < 3; i++) hue[i] = (hue[i] + diff * 5 + 360) % 360;
        } else if (selectedGroup >= 0 && selectedGroup <= 2) { // Tek grup için hue ayarı
          hue[selectedGroup] = (hue[selectedGroup] + diff * 5 + 360) % 360;
        }
      }
    }
    // Animasyon modları dışındaki durumlarda renkleri hemen uygula
    if (selectedGroup < 3 || selectedGroup == -1 || selectedGroup == 8) { // BT renk modunda da hemen uygula
      applyAllColors();
    }
    updateDisplay(); // Hız değişince OLED'i hemen güncelle
    saveSettingsToEEPROM(); // Ayarları kaydet
  }

  // Butona basılı tutma veya tıklama
  // Normal çalışma modunda buton basımını dinle (şarj ekranı aktif değilse)
  if (!chargingDisplayActive) {
    if (btnPrevState == HIGH && btnState == LOW) {
      buttonPressTime = currentTime;
    }
    if (btnPrevState == LOW && btnState == HIGH) {
      unsigned long duration = currentTime - buttonPressTime;
      if (duration >= 800) {
        // Uzun basış: parlaklık ayarı (aynı kaldı)
        int startEncoder = encoderPos;
        int currentEncoder = encoderPos;
        while (digitalRead(ENCODER_BUTTON) == LOW) { // Buton hala basılıyken
          if (encoderPos != currentEncoder) {
            int diff = encoderPos - currentEncoder;
            currentEncoder = encoderPos;
            if (selectedGroup == -1 || selectedGroup > 2 || selectedGroup == 8) { // BT renk modu için de geçerli
              for (int i = 0; i < 3; i++)
                brightness[i] = constrain(brightness[i] + diff * 0.02, 0.0, 1.0);
            } else {
              brightness[selectedGroup] = constrain(brightness[selectedGroup] + diff * 0.02, 0.0, 1.0);
            }
            applyAllColors();
            updateDisplay();
            saveSettingsToEEPROM();
          }
          delay(50); // Buton basılı tutulurken küçük bir gecikme
        }
      } else {
        // Kısa tıklama: grup/mod geçişi
        selectedGroup++;
        if (selectedGroup > 8) selectedGroup = -1; // Toplam 9 mod var (-1'den 8'e)
        
        bluetoothColorMode = false; // Manuel geçişlerde BT renk modundan çık

        // Yeni animasyon moduna geçildiğinde animasyon değişkenlerini sıfırla ve LED'leri kapat
        if (selectedGroup >= 6 && selectedGroup <= 7) {
            currentGroup = 0;
            currentColorPhase = 0;
            lastAnimationTime = currentTime; // Animasyonu hemen başlat
            allGroupsOff(); // Önceki durumdan kalma yanık LED olmasın

            // İz bırakan animasyon için sönme durumlarını sıfırla
            for(int i = 0; i < 3; i++) {
                fading[i] = false;
                lastFadeTime[i] = 0;
            }
        }

        if (selectedGroup == -1) { // "Tümü" moduna geçildiğinde tüm grupların renklerini ve parlaklıklarını eşitle
            // Başlangıçta EEPROM'dan okunan ilk grubun hue ve parlaklığını referans al
            int referenceHue = map(EEPROM.read(hueAddr[0]), 0, 255, 0, 360);
            float referenceBrightness = (float)EEPROM.read(brightnessAddr[0]) / 255.0;
            for (int i = 0; i < 3; i++) {
                hue[i] = referenceHue;
                brightness[i] = referenceBrightness;
            }
            applyAllColors(); // Renkleri hemen uygula
        } else if (selectedGroup < 6 || selectedGroup == 8) { // Animasyon modlarından çıkıldığında veya BT renk modunda renkleri geri uygula
            applyAllColors();
        }

        beepGroup(1); // Mod değişiminde kısa bip
        updateDisplay();
        saveSettingsToEEPROM();
      }
    }
  }
  btnPrevState = btnState;


  // --- Animasyon Modları ---

  // Rainbow, Offset Rainbow ve Fade Loop modları (mevcut)
  if ((selectedGroup >= 3 && selectedGroup <= 5) && currentTime - lastRainbowUpdate > animationSpeed) {
    if (selectedGroup == 3) {
      static int hueVal = 0;
      hueVal = (hueVal + 3) % 360;
      for (int i = 0; i < 3; i++) hue[i] = hueVal;
      applyAllColors();
    } else if (selectedGroup == 4) {
      static int baseHue = 0;
      int offsets[3] = {0, 120, 240};
      baseHue = (baseHue + 3) % 360;
      for (int i = 0; i < 3; i++) hue[i] = (baseHue + offsets[i]) % 360;
      applyAllColors();
    } else if (selectedGroup == 5) {
      static int groupIndex = 0;
      static bool fadeIn = true;
      static float step = 0.05;
      float maxBrightness = EEPROM.read(brightnessAddr[0]) / 255.0;
      if (maxBrightness < 0.1) maxBrightness = 0.3; // Minimum parlaklık eşiği

      if (fadeIn) {
        brightness[groupIndex] += step;
        if (brightness[groupIndex] >= maxBrightness) {
          brightness[groupIndex] = maxBrightness;
          fadeIn = false;
        }
      } else {
        brightness[groupIndex] -= step;
        if (brightness[groupIndex] <= 0.0) {
          brightness[groupIndex] = 0.0;
          fadeIn = true;
          groupIndex = (groupIndex + 1) % 3;
        }
      }
      applyAllColors();
    }
    lastRainbowUpdate = currentTime;
  }
  
