cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
  // 7. Efekt: Kesintisiz On/Off Kayma (selectedGroup == 6)
  if (selectedGroup == 6 && currentTime - lastAnimationTime >= animationSpeed) {
    lastAnimationTime = currentTime; // Zamanı sıfırla

    allGroupsOff(); // Önceki LED'i kapat

    // Sıradaki LED'i yak
    if (currentColorPhase == 0) { // Kırmızı Kayma
      setGroupColor(currentGroup, ON, OFF, OFF);
    } else if (currentColorPhase == 1) { // Mavi Kayma
      setGroupColor(currentGroup, OFF, OFF, ON);
    } else { // Yeşil Kayma
      setGroupColor(currentGroup, OFF, ON, OFF);
    }

    // Bir sonraki adıma geç
    currentGroup++;
    if (currentGroup >= 3) { // Tüm grupları geçtiysek
      currentGroup = 0;       // Başa dön
      currentColorPhase++;    // Bir sonraki renge geç
      if (currentColorPhase >= 3) { // Tüm renkleri geçtiysek
        currentColorPhase = 0;    // Başa dön (Kırmızıdan tekrar başla)
      }
    }
  }

  // 8. Efekt: İz Bırakan Kayma (selectedGroup == 7)
  if (selectedGroup == 7) {
    // Sönmekte olan LED'leri yönet
    handleFading();

    // Yeni LED'i yakma zamanı geldi mi?
    if (currentTime - lastAnimationTime >= animationSpeed) {
      lastAnimationTime = currentTime; // Zamanı sıfırla

      // Önceki LED'i sönmeye başlat
      int prevGroup = (currentGroup - 1 + 3) % 3; // Döngüsel olarak önceki grup
      if (currentGroup != 0 || currentColorPhase != 0) { // İlk yanma anında önceki yok
          startFadeOut(prevGroup);
      } else { // Animasyon ilk başladığında tüm LED'leri kapat
        allGroupsOff();
        // Aynı zamanda tüm sönme bayraklarını sıfırla
        for(int i = 0; i < 3; i++) {
          fading[i] = false;
        }
      }

      // Sıradaki LED'i yak (belirli bir renkte)
      if (currentColorPhase == 0) { // Kırmızı Kayma
        setGroupColor(currentGroup, MAX_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL);
      } else if (currentColorPhase == 1) { // Mavi Kayma
        setGroupColor(currentGroup, MIN_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL, MAX_BRIGHTNESS_VAL);
      } else { // Yeşil Kayma
        setGroupColor(currentGroup, MIN_BRIGHTNESS_VAL, MAX_BRIGHTNESS_VAL, MIN_BRIGHTNESS_VAL);
      }

      // Bir sonraki adıma geç
      currentGroup++;
      if (currentGroup >= 3) { // Tüm grupları geçtiysek
        currentGroup = 0;       // Başa dön
        currentColorPhase++;    // Bir sonraki renge geç
        if (currentColorPhase >= 3) { // Tüm renkleri geçtiysek
          currentColorPhase = 0;    // Başa dön (Kırmızıdan tekrar başla)
        }
      }
    }
  }


  // OLED Ekran Güncellemesi
  if (currentTime - lastOledUpdateGlobal >= 200) { // 200ms'de bir güncelle
    updateDisplay();
    lastOledUpdateGlobal = currentTime;
  }
}

// bu koda sağ köşeye küçük batarya iconu çizer

void drawBatteryMiniIcon(int x, int y, float voltage, bool charging) {
  const int width = 12;
  const int height = 6;
  // Küçük ikon için max 5 bar
  int fillBars = getFillBarsFromVoltage(voltage);
  if (fillBars == 0 && getNiMHBatteryPercentage(voltage) > 0) fillBars = 1; // 0% değilse en az 1 bar göster

  display.drawRect(x, y, width, height, SSD1306_WHITE);
  display.drawRect(x + width, y + 2, 2, 2, SSD1306_WHITE); // başlık

  for (int i = 0; i < fillBars; i++) {
    int bx = x + 1 + i * 2;
    display.drawFastVLine(bx, y + 1, height - 2, SSD1306_WHITE);
  }

  // Eğer şarj ediliyorsa en son çizgi yanıp sönecek
  if (charging) {
    static unsigned long lastBlink = 0;
    static bool visible = true;
    if (millis() - lastBlink > 500) {
      visible = !visible;
      lastBlink = millis();
    }
    // Maksimum bara ulaştıysa yanıp sönme olmasın
    if (visible && fillBars < (width / 2) - 1) { // Örneğin 5 bar için 4. barı kontrol et
      int bx = x + 1 + fillBars * 2;
      display.drawFastVLine(bx, y + 1, height - 2, SSD1306_WHITE);
    }
  }
}

/*

// --- drawBatteryMiniIcon Fonksiyon Tanımı (Güncellenmiş Boyutlar ve Konum) ---
// --- drawBatteryMiniIcon Fonksiyon Tanımı (Kesin Dikey 15x35px) ---
// Bu fonksiyon dikey bir pil ikonu çizecek.
void drawBatteryMiniIcon(int x, int y, float voltage, bool charging) {
  const int width = 15;  // Pil ikonunun YENİ GENİŞLİĞİ (dikey ikon için kısa kenar)
  const int height = 35; // Pil ikonunun YENİ YÜKSEKLİĞİ (dikey ikon için uzun kenar)

  // Pil gövdesini çiz
  display.drawRect(x, y, width, height, SSD1306_WHITE);

  // Pil başlığını (artı ucu) çiz (üstte olacak)
  int capWidth = 6; // Başlık genişliği
  int capHeight = 4; // Başlık yüksekliği
  int capX = x + (width - capWidth) / 2; // Yatayda ortala
  int capY = y - capHeight; // Gövdenin hemen üstüne
  display.drawRect(capX, capY, capWidth, capHeight, SSD1306_WHITE);

  // Pil seviyesini belirleyen bar sayısını hesapla (maksimum 10 bar)
  // Pil yüksekliği 35px, çerçeve için 2px düşünce 33px kullanılabilir alan kalır.
  // 10 bar için, her bar ortalama 3.3px yüksekliğinde olacak.
  // getFillBarsFromVoltage 0-10 arası değer döndürür, bu yüzden doğrudan kullanabiliriz.
  int fillBars = getFillBarsFromVoltage(voltage); 
  fillBars = constrain(fillBars, 0, 10); // Değeri 0 ile 10 arasına sınırla

  // Eğer NiMH pil kullanıyorsan ve pil neredeyse boşsa (0 bar çıktıysa) ama hala şarj varsa, en az 1 bar göster.
  // Eğer Li-Ion kullanıyorsan veya getNiMHBatteryPercentage tanımlı değilse bu satırı yorum satırı yapabilirsin.
  // if (fillBars == 0 && getNiMHBatteryPercentage(voltage) > 0) fillBars = 1; 

  // Her barın genişliğini ve yüksekliğini hesapla (çerçeve boşluklarını düşerek)
  // Barlar dikey olarak, alttan yukarıya doğru yükselecek.
  int barWidth = width - 2;          // Çerçeve içindeki genişlik
  int barHeight = (height - 2) / 10; // 10 bar için her barın yüksekliği

  // Dolu barları alttan yukarıya doğru çiz
  for (int i = 0; i < fillBars; i++) {
    // Barlar alttan yukarıya doğru yükselmeli
    // y + height - 1: Pilin alt kenarı
    // (i + 1) * barHeight: Çizilen barın yüksekliği kadar yukarı çık
    int barY = y + height - 1 - ((i + 1) * barHeight); 
    display.fillRect(x + 1, barY, barWidth, barHeight - 1, SSD1306_WHITE); // BarHeight-1 çakışmayı önler
  }

