cemyasam2/esp32_bluetooth_RGB/esp32_bluetooth_RGB_.ino
  // Şarj durumunda en üstteki bara yanıp sönme efekti ekle
  if (charging) {
    static unsigned long lastBlink = 0;
    static bool visible = true;
    
    // Her 500 milisaniyede bir görünürlük durumunu değiştir
    if (millis() - lastBlink > 500) {
      visible = !visible;
      lastBlink = millis();
    }

    // Yanıp sönecek barın indeksini belirle
    // Eğer pil tam dolu değilse (fillBars < 10), doldurulacak bir sonraki boş çubuk yanıp söner.
    // Eğer pil tam doluysa (fillBars == 10), en üstteki dolu çubuk (indeks 9) yanıp söner.
    int blinkingBarIndex;
    if (fillBars < 10) { 
        blinkingBarIndex = fillBars; // Bir sonraki boş barın indeksi
    } else { 
        blinkingBarIndex = 9; // En üstteki barın indeksi (0-9 arası 10 bar için)
    }

    // Yanıp sönecek barın Y koordinatını hesapla
    int blinkingBarY = y + height - 1 - ((blinkingBarIndex + 1) * barHeight);

    // Sadece geçerli bir bar indeksi ise ve pil çerçevesinin içindeyse çizim yap
    if (blinkingBarIndex >= 0 && blinkingBarIndex < 10 && blinkingBarY >= y + 1) {
        if (visible) {
            display.fillRect(x + 1, blinkingBarY, barWidth, barHeight - 1, SSD1306_WHITE);
        } else {
            // Görünmezse, o barı siyahla doldurarak sil
            display.fillRect(x + 1, blinkingBarY, barWidth, barHeight - 1, SSD1306_BLACK); 
        }
    }
  }
}*/
void drawBatteryWithFillBars(float voltage, bool charging) {
  display.clearDisplay();

  // Pil dış çerçevesi
  const int batteryWidth = SCREEN_WIDTH - 40;    // 88
  const int batteryHeight = SCREEN_HEIGHT - 40; // 24
  const int batteryX = (SCREEN_WIDTH - batteryWidth) / 2;    // 20
  const int batteryY = (SCREEN_HEIGHT - batteryHeight) / 2; // 20

  // Gövde ve başlık çiz
  display.drawRect(batteryX, batteryY, batteryWidth, batteryHeight, SSD1306_WHITE);
  display.drawRect(batteryX + batteryWidth, batteryY + (batteryHeight - 8) / 2, 6, 8, SSD1306_WHITE);

  // Doluluk çizgileri
  int bars = getFillBarsFromVoltage(voltage);    // Kaç çizgi dolacak
  const int barWidth = 8;
  const int barHeight = 20;
  const int spacing = 1;
  const int totalBars = 10;
  const int barAreaWidth = totalBars * (barWidth + spacing) - spacing;

  // Ortalamak için X başlangıç pozisyonu
  int startX = batteryX + (batteryWidth - barAreaWidth) / 2;
  int barY = batteryY + (batteryHeight - barHeight) / 2;

  for (int i = 0; i < bars; i++) {
    int x = startX + i * (barWidth + spacing);

    // Son bar mı ve şarj ediliyor mu?
    if (i == bars - 1 && charging && bars < totalBars) { // Son bara ulaştıysa yanıp sönme olmasın
      static unsigned long lastBlink = 0;
      static bool visible = true;
      if (millis() - lastBlink > 500) {
        visible = !visible;
        lastBlink = millis();
      }
      if (visible) {
        display.fillRect(x, barY, barWidth, barHeight, SSD1306_WHITE);
      }
    } else {
      display.fillRect(x, barY, barWidth, barHeight, SSD1306_WHITE);
    }
  }

  // Voltajı ekranda göster
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(batteryX + 3, batteryY + batteryHeight + 5); // Pilin altına
  display.printf("Voltage: %.2fV", voltage);
  display.display();
}
